trade_exp/src/Documents/ЗаявкаВЕГАИСЛес/ЗаявкаВЕГАИСЛес.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаявкаВЕГАИСЛес</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ПунктНазначенияЮЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>НаименованиеИЮрАдресЮЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИННЮЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОбъемДревесины</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресРегистрацииФЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерДекларацииЮЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>28</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПаспортСерияФЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ТипКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПаспортНомерФЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>6</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ГосНомерТСЮЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ФИОФЛ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6a69ca45-0e55-4677-9e8c-10a91d895711">
    <name>НомерДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0707329a-9fe5-4733-be0b-09fbb4099af3">
    <name>ЗаявкаСозданаНаОснованииПеремещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Document>

trade_exp/src/Documents/ЗаявкаВЕГАИСЛес/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если ТекущиеДанные.ТипКлиента = ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо") Тогда
			ЭтаФорма.Элементы.ФормаДокументЗаявкаВЕГАИСЛесПечатьБланка.Видимость = Ложь;
			ЭтаФорма.Элементы.ФормаДокументЗаявкаВЕГАИСЛесПечатьТНЮЛ.Видимость = РейсИЛИЗаказЕсть(ТекущиеДанные.Основание);
		Иначе
			ЭтаФорма.Элементы.ФормаДокументЗаявкаВЕГАИСЛесПечатьБланка.Видимость = Ложь;
			ЭтаФорма.Элементы.ФормаДокументЗаявкаВЕГАИСЛесПечатьТНЮЛ.Видимость = Истина;
		КонецЕсли;
		Если ТекущиеДанные.Статус = Истина Тогда
			ЭтаФорма.Элементы.ФормаЗанесеноВЕГАИС.Доступность = Ложь;
		Иначе
			ЭтаФорма.Элементы.ФормаЗанесеноВЕГАИС.Доступность = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗанесеноВЕГАИС(Команда)
    
    ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
    ИзменитьСтатус(ВыделенныеСтроки, "Выполнить");
    Элементы.Список.Обновить();
    
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзменитьСтатус(ВыделенныеСтроки, Команда)
   	
    Если НЕ ЗначениеЗаполнено(ВыделенныеСтроки) Тогда
        Возврат;
    КонецЕсли;
    
    Если Команда = "Выполнить" Тогда
        Состояние = Истина;
    Иначе Если Команда = "Отменить" Тогда
        Состояние = Ложь;
	КонецЕсли; 
	КонецЕсли;
    
    Сумма = 0;
    Для Каждого Строка Из ВыделенныеСтроки Цикл
        Объект = Строка.ПолучитьОбъект();
        Объект.Статус = Состояние;
        Объект.Записать();      
    КонецЦикла; 

КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
    ИзменитьСтатус(ВыделенныеСтроки, "Отменить");
	Элементы.Список.Обновить();	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция РейсИЛИЗаказЕсть(Основание)
	Возврат Документы.ЗаявкаВЕГАИСЛес.СуществуютРейсыИлиЗаказыНаДоставку(Основание);
КонецФункции
